app/controllers/store_controller.rb

SELECT * FROM `products` WHERE (`products`.`id` = 1)
---
  def add_to_cart
   #count index
   if session[:count_index] > 0
     session[:count_index] = nil
   end

   product = Product.find(params[:id])